In [1]:
import pandas as pd

X_train = pd.DataFrame({"name": ["Jitesh", "Rahul", "John", "Bill"],
                        "income": [40, 50, 60, 70],
                        "education": ["Grad", "Grad", "Post-Grad", "Post-Grad"]})

X_train_enc = pd.get_dummies(X_train)
train_enc_cols = X_train_enc.columns

In [2]:
X_train

     name  income  education
0  Jitesh      40       Grad
1   Rahul      50       Grad
2    John      60  Post-Grad
3    Bill      70  Post-Grad

In [3]:
X_train_enc

,income,name_Bill,name_Jitesh,name_John,name_Rahul,education_Grad,education_Post-Grad
0,40,0,1,0,0,1,0
1,50,0,0,0,1,1,0
2,60,0,0,1,0,0,1
3,70,1,0,0,0,0,1

In [4]:
import joblib
obj_file = "./outputs/columns.pkl"

joblib.dump(value=train_enc_cols, filename=obj_file)

['./outputs/columns.pkl']

In [5]:
ref_cols = joblib.load(obj_file)
ref_cols

Index(['income', 'name_Bill', 'name_Jitesh', 'name_John', 'name_Rahul',
       'education_Grad', 'education_Post-Grad'],
      dtype='object')

In [8]:
X_deploy = pd.DataFrame({'name': ["Jitesh"],
                         "income": [70],
                         "education": ["Post-Grad"]})

X_deploy

     name  income  education
0  Jitesh      70  Post-Grad

In [9]:
X_deploy_enc = pd.get_dummies(X_deploy)
X_deploy_enc

   income  name_Jitesh  education_Post-Grad
0      70            1                    1

In [11]:
deploy_cols = X_deploy_enc.columns
deploy_cols

Index(['income', 'name_Jitesh', 'education_Post-Grad'], dtype='object')

In [12]:
missing_cols = ref_cols.difference(deploy_cols)
missing_cols

Index(['education_Grad', 'name_Bill', 'name_John', 'name_Rahul'], dtype='object')

In [13]:
for cols in missing_cols:
    X_deploy_enc[cols] = 0

X_deploy_enc

,income,name_Jitesh,education_Post-Grad,education_Grad,name_Bill,name_John,name_Rahul
0,70,1,1,0,0,0,0

In [14]:
X_deploy_enc = X_deploy_enc[ref_cols]
X_deploy_enc

,income,name_Bill,name_Jitesh,name_John,name_Rahul,education_Grad,education_Post-Grad
0,70,0,1,0,0,0,1

In [ ]:
X_deploy_enc = pd.get_dummies(X_deploy)
X_deploy_enc

In [15]:
X_deploy = pd.DataFrame({'name': ["Jitesh"],
                         "income": [70],
                         "education": ["Post-Grad1"]})

X_deploy_enc = pd.get_dummies(X_deploy)
deploy_cols = X_deploy_enc.columns
missing_cols = ref_cols.difference(deploy_cols)

for cols in missing_cols:
    X_deploy_enc[cols] = 0

X_deploy_enc = X_deploy_enc[ref_cols]
X_deploy_enc

,income,name_Bill,name_Jitesh,name_John,name_Rahul,education_Grad,education_Post-Grad
0,70,0,1,0,0,0,0

In [16]:
extra_cols = deploy_cols.difference(ref_cols)
extra_cols

Index(['education_Post-Grad1'], dtype='object')

In [17]:
if len(extra_cols):
    print("There is an unknown category")

There is an unknown category